# MarkNonplotLayers Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ACADExportOptions..::..MarkNonplotLayers Property
ACADExportOptions Class See Also
---
If true and the nonplot layer suffix is not empty, all layers whose names contain that suffix will be marked as non-plot.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool MarkNonplotLayers { get; set; }
```

Visual Basic
---
```text
Public Property MarkNonplotLayers As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool MarkNonplotLayers {
	bool get ();
	void set (bool value);
}
```

# Remarks
A typical use would be to mark as non-plot all layers containing -NPLT. Default value is false
# See Also
ACADExportOptions Class
Autodesk.Revit.DB Namespace